---
kind: property
id: P:Autodesk.Revit.DB.TableView.TargetId
source: html/255a4253-4f37-1ccf-f80f-59e7c7c1d757.htm
---
# Autodesk.Revit.DB.TableView.TargetId Property

the element id of the element that is being viewed

## Syntax (C#)
```csharp
public ElementId TargetId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null